#### :building_construction: Terraform Plan
  <details>

  <summary>dev - 0 to add, 1 to change, 0 to destroy</summary>

  ```
  Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.supernode[0].proxmox_vm_qemu.supernode will be updated in-place
  ~ resource "proxmox_vm_qemu" "supernode" {
      + default_ipv4_address   = (known after apply)
        id                     = "pm4/qemu/104"
        name                   = "supernode-dev-0"
      + ssh_host               = (known after apply)
      + ssh_port               = (known after apply)
        tags                   = null
      ~ vm_state               = "stopped" -> "running"
        # (60 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
  ```

  </details>